In [1]:
list3 = [ 11, 12, 13, 14, 15, 16, 17, 18]
for i in list3:
  print(i)

11
12
13
14
15
16
17
18

파이썬
자료구조 -> 데이타프레임 -> 요약값/시각화 -> 데이타프레임(indexing, slicing) -> sklearn(분석)


데이타 분석 (DA:Data ananalysis)
data -> 전처리 -> EDA(탐색적 데이타 분석) -> Data manipulation -> 모델링 -> 분석 -> 평가

==========

전처리 :
ㅁ missing value 에 대해 어떻게 처리? (na / nan)
 1. 일부가 비면 그냥 해당 row 삭제 
 2. 채우기 

ㅁ 값을 조정
 1. scaling ( 시력과 대출 ) # 시력은 숫자가 작고, 대출은 엄청 큼 => 상대적인 크기로 조정
    min-max scaling / standard scaling 

ㅁ 값을 치환 
  잘못된 값으로 다른 값으로 수정 

ㅁ 파티셔닝 
  행 단위로 전체 데이타를 나눔 (data를 분석 / 검증용으로 나눔)
  data -> 분석 -> 예측

In [8]:
#creditApprovalUCI.csv를 읽은 후 missing을 찾아보세요
#dropna로 missing행을 지워보세요
#fillna로 missing을 특정값으로 채워보세요

import pandas as pd
df1 = pd.read_csv("./data/creditApprovalUCI.csv")   # DataFrame만들기
df1.info()

df1.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 690 entries, 0 to 689
Data columns (total 16 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A1      678 non-null    object
 1   A2      678 non-null    float64
 2   A3      598 non-null    float64
 3   A4      684 non-null    object
 4   A5      684 non-null    object
 5   A6      681 non-null    object
 6   A7      681 non-null    object
 7   A8      598 non-null    float64
 8   A9      598 non-null    object
 9   A10     598 non-null    object
 10  A11     690 non-null    int64
 11  A12     690 non-null    object
 12  A13     690 non-null    object
 13  A14     677 non-null    float64
 14  A15     690 non-null    int64
 15  A16     690 non-null    int64
dtypes: float64(4), int64(3), object(9)
memory usage: 86.4+ KB

A1     12
A2     12
A3     92
A4      6
A5      6
A6      9
A7      9
A8     92
A9     92
A10    92
A11     0
A12     0
A13     0
A14    13
A15     0
A16     0
dtype: int64

In [9]:
df1.dropna().info()
df1.dropna().shape

df1.dropna(inplace=True) # 원본에 적용

<class 'pandas.core.frame.DataFrame'>
Index: 564 entries, 0 to 689
Data columns (total 16 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A1      564 non-null    object
 1   A2      564 non-null    float64
 2   A3      564 non-null    float64
 3   A4      564 non-null    object
 4   A5      564 non-null    object
 5   A6      564 non-null    object
 6   A7      564 non-null    object
 7   A8      564 non-null    float64
 8   A9      564 non-null    object
 9   A10     564 non-null    object
 10  A11     564 non-null    int64
 11  A12     564 non-null    object
 12  A13     564 non-null    object
 13  A14     564 non-null    float64
 14  A15     564 non-null    int64
 15  A16     564 non-null    int64
dtypes: float64(4), int64(3), object(9)
memory usage: 74.9+ KB

(564, 16)

In [5]:
df1.fillna("na")

#imputing -> sklearn.preprocessing imputer

,A1,A2,A3,A4,A5,A6,A7,A8,A9,A10,A11,A12,A13,A14,A15,A16
0,b,30.83,0.0,u,g,w,v,1.25,t,t,1,f,g,202.0,0,1
1,a,58.67,4.46,u,g,q,h,3.04,t,t,6,f,g,43.0,560,1
2,a,24.5,na,u,g,q,h,na,na,na,0,f,g,280.0,824,1
3,b,27.83,1.54,u,g,w,v,3.75,t,t,5,t,g,100.0,3,1
4,b,20.17,5.625,u,g,w,v,1.71,t,f,0,f,s,120.0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
685,b,21.08,10.085,y,p,e,h,1.25,f,f,0,f,g,260.0,0,0
686,a,22.67,0.75,u,g,c,v,2.0,f,t,2,t,g,200.0,394,0
687,a,25.25,13.5,y,p,ff,ff,2.0,f,t,1,t,g,200.0,1,0
688,b,17.92,0.205,u,g,aa,v,0.04,f,f,0,f,g,280.0,750,0
689,b,35.0,3.375,u,g,c,h,8.29,f,f,0,t,g,0.0,0,0

In [10]:
df1.head()

  A1     A2     A3 A4 A5 A6 A7    A8   A9  A10  A11 A12 A13    A14  A15  A16
0  b  30.83  0.000  u  g  w  v  1.25    t    t    1   f   g  202.0    0    1
1  a  58.67  4.460  u  g  q  h  3.04    t    t    6   f   g   43.0  560    1
2  a  24.50    NaN  u  g  q  h   NaN  NaN  NaN    0   f   g  280.0  824    1
3  b  27.83  1.540  u  g  w  v  3.75    t    t    5   t   g  100.0    3    1
4  b  20.17  5.625  u  g  w  v  1.71    t    f    0   f   s  120.0    0    1

In [11]:
df2 = pd.read_csv("./data/adv.csv")   # DataFrame만들기

In [12]:
df2.head()

   Unnamed: 0     TV  radio  newspaper  sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [ ]:

a = [0, 0.5, 1]
b = [100000000, 500000000, 0]
# min_max scaling : 값 - 최소 / 최대 - 최소
a1 = [0, 0.5, 1]
b1 = [1, 0.5, 0] 

# standard scaling : 값 - 평균 / 표준편차

In [19]:
# sklearn 값, 평균 => fit  / 값 변환 transform
from sklearn.preprocessing import MinMaxScaler, StandardScaler
#scaler = MinMaxScaler()
scaler = StandardScaler()
#scaler.fit()
#scaler.transform()
#result = scaler.fit_transform() # data scaler 결과는 array

TypeError: TransformerMixin.fit_transform() missing 1 required positional argument: 'X'

In [14]:
#creditset.csv를 crd로 읽어서 minmax scaling을 해보세요
crd = pd.read_csv("./data/creditset.csv")
crd.info()
crd.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   clientid     2000 non-null   int64
 1   income       2000 non-null   float64
 2   age          2000 non-null   float64
 3   loan         2000 non-null   float64
 4   LTI          2000 non-null   float64
 5   default10yr  2000 non-null   int64
dtypes: float64(4), int64(2)
memory usage: 93.9 KB

(2000, 6)

In [20]:
from sklearn.preprocessing import MinMaxScaler
scaler = StandardScaler()
result = scaler.fit_transform(crd) # data scaler 결과는 array 
rpd  = pd.DataFrame(result, columns = crd.columns) # array를 dataframe으로 변환
rpd.info()

rpd.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   clientid     2000 non-null   float64
 1   income       2000 non-null   float64
 2   age          2000 non-null   float64
 3   loan         2000 non-null   float64
 4   LTI          2000 non-null   float64
 5   default10yr  2000 non-null   float64
dtypes: float64(6)
memory usage: 93.9 KB

   clientid    income       age      loan       LTI  default10yr
0 -1.731185  1.453934  1.364333  1.202819  0.418950    -0.405983
1 -1.729453 -0.762176  0.542268  0.696427  1.603115    -0.405983
2 -1.727721  0.836821  1.672877  1.174711  0.721055    -0.405983
3 -1.725989 -0.183070  0.363887  0.544980  0.772625    -0.405983
4 -1.724257  1.509563 -1.685088  1.420765  0.565684     2.463156

In [22]:
#특정 컬럼만 scaling
result2 = scaler.fit_transform(crd[["income", "age", "loan"]])
rpd2  = pd.DataFrame(result2, columns = ["income", "age", "loan"]) # array를 dataframe으로 변환
rpd2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   income  2000 non-null   float64
 1   age     2000 non-null   float64
 2   loan    2000 non-null   float64
dtypes: float64(3)
memory usage: 47.0 KB

In [26]:
rpd3 = crd [ [ "clientid", "LTI", "default10yr"]]
crd2 = pd.concat([rpd2, rpd3], axis=1) # axis = 1 컬럼방향으로 합치기
crd2

        income       age      loan  clientid       LTI  default10yr
0     1.453934  1.364333  1.202819         1  0.122537            0
1    -0.762176  0.542268  0.696427         2  0.190752            0
2     0.836821  1.672877  1.174711         3  0.139940            0
3    -0.183070  0.363887  0.544980         4  0.142911            0
4     1.509563 -1.685088  1.420765         5  0.130989            1
...        ...       ...       ...       ...       ...          ...
1995  0.969747  0.572514 -0.826907      1996  0.032535            0
1996  1.688540 -1.339834 -0.309130      1997  0.050394            0
1997 -0.071226 -0.973667  0.354201      1998  0.124636            1
1998 -0.110003  1.738021 -0.926756      1999  0.037086            0
1999  1.682986  1.148301  0.963810      2000  0.106267            0

[2000 rows x 6 columns]

In [29]:
from sklearn.model_selection import train_test_split
train, test = train_test_split(crd2, test_size=0.2)
print(train.shape)
print(test.shape)

X_Train, X_test, y_train, y_test = train_test_split(crd2[["age","income"]], crd2["default10yr"], test_size=0.2)

# stratify : 원래 분포를 유지시켜줌 ( 그냥 잘라버리면 한쪽으로 데이타의 특정값이 몰릴 수가 있어서 분포에 맞게)
X_Train, X_test, y_train, y_test = train_test_split(crd2[["age","income"]], crd2["default10yr"], stratify = crd2["default10yr"], test_size=0.2)

(1600, 6)
(400, 6)

In [44]:
# binary.csv 파일을 읽어서 null을 확인해주세요
# gre, gpa를 scaling 해주세요, admit 변수와 합친 데이터프레임 binary2를 만드세요
# binary2를 파티셔님해주세요 (stratify -> admit , 3:1 로 나누세요)

binary = pd.read_csv("data/binary.csv")
#binary.info()
binary.describe()
#binary.isnull().sum()

            admit         gre         gpa       rank
count  400.000000  400.000000  400.000000  400.00000
mean     0.317500  587.700000    3.389900    2.48500
std      0.466087  115.516536    0.380567    0.94446
min      0.000000  220.000000    2.260000    1.00000
25%      0.000000  520.000000    3.130000    2.00000
50%      0.000000  580.000000    3.395000    2.00000
75%      1.000000  660.000000    3.670000    3.00000
max      1.000000  800.000000    4.000000    4.00000

In [48]:
sc = MinMaxScaler()
t1 = pd.DataFrame(sc.fit_transform(binary[["gre","gpa"]]), columns=["gre","gpa"] )
t2 = binary["admit"]
binary2 = pd.concat([t1, t2], axis=1)
binary2.head()

        gre       gpa  admit
0  0.275862  0.775862      0
1  0.758621  0.810345      1
2  1.000000  1.000000      1
3  0.724138  0.534483      1
4  0.517241  0.385057      0

In [51]:
x_train, x_test, y_train, y_test = train_test_split(binary2[["gre","gpa"]], binary2["admit"], stratify = binary2["admit"], test_size=0.25) # random_state =1

print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(300, 2)
(100, 2)
(300,)
(100,)